In [1]:
import pandas as pd
import numpy as np

In [28]:
df_ls = pd.read_csv("/home/ls283h/Work/Strava/2016/od/Glasgow_1K_buffer_2016_od.csv")

In [29]:
df_ls.head()

      ID  Unnamed: 1
0  18076         NaN
1  17989         NaN
2  20176         NaN
3  22484         NaN
4  20260         NaN

In [30]:
id = df_ls.ID.unique()

In [31]:
id[0:10]

array([18076, 17989, 20176, 22484, 20260,  7952,   164, 22367, 17443,
       17755])

In [32]:
df_sco= pd.read_csv("/home/ls283h/Work/Strava/2016/od/scotland_20160101_20161231_ride_od_hourly.csv")
df_sco.head()

,polygon_id,dest_polygon_id,year,day,hour,minute,commute_count,athlete_count,activity_count,distance,duration
0,88,42876,2016,157,11,0,10,10,10,89244.0,9840
1,88,42876,2016,233,10,0,10,10,10,89191.0,7860
2,109,109,2016,268,10,0,0,5,5,61858.5,7860
3,153,153,2016,140,10,0,0,5,5,29934.0,12930
4,153,153,2016,156,10,0,0,5,5,30504.5,23790

In [33]:
df_glasgow_dest = df_sco[df_sco['dest_polygon_id'].isin(id)]
df_glasgow_dest.shape

(49, 11)

In [34]:
df_glasgow_orig = df_sco[df_sco['polygon_id'].isin(id)]
df_glasgow_orig.shape

(161, 11)

In [35]:
df_glasgow = pd.concat([df_glasgow_orig, df_glasgow_dest], ignore_index=True)
df_glasgow.shape

(210, 11)

In [36]:
df_glasgow.drop_duplicates(inplace=True)
df_glasgow.shape

(163, 11)

In [37]:
df_glasgow.to_csv('/home/ls283h/Work/Strava/2016/od/glasgow__20160101_20161231_ride_od_hourly_Luis.csv', index=False)

In [38]:
df_nadiia = pd.read_csv("/home/ls283h/Work/Strava/2016/od/glasgow_2016_ride_od_hourly_Nadiia.csv")
df_nadiia.tail()

,polygon_id,dest_polygon_id,year,day,hour,minute,commute_count,athlete_count,activity_count,distance,duration
158,20111,2700,2016,322,11,0,5,5,5,133804.0,18900
159,20661,20661,2016,230,19,0,0,5,5,49168.5,7410
160,22812,29726,2016,261,10,0,5,5,5,183762.5,30960
161,29726,2839,2016,262,7,0,5,5,5,155179.0,31500
162,38348,19519,2016,114,7,0,5,5,5,82572.0,13920

In [39]:
edgesID_Luis_notin_Nadiia = df_glasgow[~df_glasgow['polygon_id'].isin(df_nadiia['polygon_id'])]
edgesID_Luis_notin_Nadiia.head()
#edgesID_Luis_notin_Nadiia.shape

Empty DataFrame
Columns: [polygon_id, dest_polygon_id, year, day, hour, minute, commute_count, athlete_count, activity_count, distance, duration]
Index: []

In [40]:
edgesID_Nadiia_notin_Luis = df_nadiia[~df_nadiia['polygon_id'].isin(df_glasgow['polygon_id'])]
edgesID_Nadiia_notin_Luis

Empty DataFrame
Columns: [polygon_id, dest_polygon_id, year, day, hour, minute, commute_count, athlete_count, activity_count, distance, duration]
Index: []

In [24]:
polygons = edgesID_Nadiia_notin_Luis['dest_polygon_id'].unique()
polygons

array([], dtype=int64)